
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Настройки", Настройки);
		
	Заголовок = СтрШаблон("Логи настройки Кафки: %1", Настройки);
	Каталог = Справочники.НастройкиКафки.КаталогЛогов(Настройки);
	
	ОбновитьФайлыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФайлыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Файлы.ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ЛогФайл = Каталог + Элементы.Файлы.ТекущиеДанные.Имя;	
	ФайлыПриАктивизацииСтрокиНаСервере(ЛогФайл);
	
КонецПроцедуры

&НаСервере
Процедура ФайлыПриАктивизацииСтрокиНаСервере(ЛогФайл)
	
	Логи.Очистить();
	Если НЕ ЗначениеЗаполнено(ЛогФайл) Тогда 
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ЛогФайл);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	Логи.Прочитать(ЛогФайл);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ФайлыПередУдалением(Элемент, Отказ)

	УдалитьФайлыНаСервере(Элементы.Файлы.ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФайлы(Команда)
	ОбновитьФайлыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьФайлыНаСервере()
	
	Файлы.Очистить();
	
	НайденныеФайлы = НайтиФайлы(Каталог, "*.log");
	Для каждого Файл Из НайденныеФайлы Цикл
		НоваяСтрока = Файлы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Файл);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УдалитьФайлыНаСервере(ИдентификаторыСтрок)
	
	Для каждого Идентификатор Из ИдентификаторыСтрок Цикл
		Строка = Файлы.НайтиПоИдентификатору(Идентификатор);
		УдалитьФайлы(Строка.Имя);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
