// Модуль для совместимости с БСП

#Область ПрограммныйИнтерфейс

// Показать сообщение пользователю
//
// Параметры:
//  ТекстСообщения	 - Строка	 - Текст сообщения
//  КлючДанных		 - ЛюбаяСсылка	 - Ключ данных сообщения
//  Поле			 - Строка		 - Поле формы к которому необходимо привязать сообщение
//  ПутьКДанным		 - Строка		 - Пусть к данным формы к которым надо привязать сообщение
//  Отказ			 - Булево		 - Флаг отказа, если указан, будет установлен в Итсина
//
Процедура СообщитьПользователю(Знач ТекстСообщения, Знач КлючДанных = Неопределено,	Знач Поле = "",
	Знач ПутьКДанным = "", Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = НСтр(ТекстСообщения);
	Сообщение.КлючДанных = КлючДанных;
	Сообщение.Поле = Поле;
	Сообщение.ПутьКДанным = ПутьКДанным;
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

// Возвращает символ слеш в зависимости от операционной системы
// 
// Возвращаемое значение:
//  Стркоа - Символ слеш
//
Функция Слеш() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
    	ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат "\";
	КонецЕсли;
	
	Возврат "/";
		
КонецФункции

#КонецОбласти