
#Если Сервер ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает настройку Кафки найденную по Идентификатору
//
// Параметры:
//  Идентификатор	 - Строка	 - Идентификатор настройки
// 
// Возвращаемое значение:
//  СправочникСсылка.НастройкиКафки - Найденная настройка
//
Функция НайтиПоИдентификатору(Идентификатор) Экспорт
	
	Настройка = НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если НЕ ЗначениеЗаполнено(Настройка) Тогда
		ВызватьИсключение СтрШаблон("Не удалось найти настройку Кафки по идентификатору '%1'", Идентификатор);	
	КонецЕсли;
	
	Возврат Настройка;
		
КонецФункции

// Возвращает каталог логов для настройки Кафки
//
// Параметры:
//  Настройка	 - СправочникСсылка.НастройкиКафки	 - Настройка
// 
// Возвращаемое значение:
//  Строка - Каталог логов
//
Функция КаталогЛогов(Настройка) Экспорт

	Разделитель = ПолучитьРазделительПутиСервера();
	
	Возврат КаталогВременныхФайлов() + "rdkafka-1c" + Разделитель + Настройка.Идентификатор + Разделитель;
	
КонецФункции

#КонецОбласти

#КонецЕсли
