
#Область ПрограммныйИнтерфейс

// Возвращает настройку Кафки найденную по Идентификатору
//
// Параметры:
//  Идентификатор	 - Строка	 - Идентификатор настройки
// 
// Возвращаемое значение:
//  СправочникСсылка.НастройкиКафки - Найденная настройка
//
Функция НайтиПоИдентификатору(Идентификатор) Экспорт
	
	Настройки = НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если НЕ ЗначениеЗаполнено(Настройки) Тогда
		ВызватьИсключение СтрШаблон("Не удалось найти настройку Кафки по идентификатору '%1'", Идентификатор);	
	КонецЕсли;
	
	Возврат Настройки;
		
КонецФункции

#КонецОбласти