
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	ПроверитьУникальностьИдентификатора(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьУникальностьИдентификатора(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиКафки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиКафки КАК НастройкиКафки
		|ГДЕ
		|	НастройкиКафки.Идентификатор = &Идентификатор
		|	И НастройкиКафки.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекстСообщения = СтрШаблон("Уже существет настройка Кафки %1 с идентификатором %2",
			Выборка.Ссылка, Идентификатор);		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка, , Отказ);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти
